[
    {
         "id": 1,
         "name": "Shawarma Combo",
         "description": "Two shawarma sandwiches served with golden fries, two garlic sauces, and pickles.",
         "price": 25,
         "image": "images/offers/shawarma-combo.jpg"
     
    },

     {
         "id": 2,
         "name": "Seafood Special",
         "description": "A mouthwatering seafood feast featuring juicy shrimp, tender crab legs, sweet corn on the cob, soft potatoes, and fresh lemon slices — all seasoned with rich Cajun spices.",
         "price": 55,
         "image": "images/offers/Seafood_Special.avif"
 
    },

     {
         "id": 3,
         "name": "Mixed Grill Platter",
         "description": "A premium mix of flame-grilled chicken drumsticks, juicy sausages, tender steak, and smoky zucchini & eggplant. Served with roasted lemon, creamy potato salad, and a fresh green dip.",
         "price": 60,
         "image": "images/offers/Grilled_Platter.webp"
    },

     {
         "id": 4,
         "name": "Stuffed Vine & Cabbage Leaves Box",
         "description": "A luxurious box of tender grape leaves stuffed with aromatic rice and herbs, alongside delicious cabbage rolls filled with a flavorful mix. Garnished with pomegranate seeds and fresh vegetables for a perfect bite.",
         "price": 40,
         "image": "images/offers/Grape_Leaves_Combo.jpg"
    },

     {
         "id": 5,
         "name": "Falafel Party Box",
         "description": "12 mini falafel sliders made with crispy golden falafel, fresh vegetables, pickles, and creamy tahini sauce. Comes with extra dipping sauce and a side of tangy pickled veggies",
         "price": 40,
         "image": "images/offers/Falafel_Box.jpg"
    },

     {
         "id": 6,
         "name": "Family Box",
         "description": "Four gourmet burgers: a spicy beef burger with jalapeños, a juicy mushroom Swiss burger, a grilled chicken avocado burger, and a hearty veggie burger.Paired with crispy crinkle-cut fries, golden onion rings, and sweet potato fries",
         "price": 50,
         "image": "images/offers/Family_Box3.jpg"
   
    },

     {
         "id": 7,
         "name": "Kebab Platter",
         "description": "A hearty mix of grilled chicken and beef kebabs served over saffron rice, with fresh salad, creamy hummus, warm pita bread, and garlic sauce on the side.",
         "price": 40,
         "image": "images/offers/combo-kofta-kebab-platter.jpg"
    },

     {
         "id": 8,
         "name": "Crispy Combo Meal",
         "description": "6 crispy chicken sandwiches (3 classic & 3 spicy) made with golden fried chicken, fresh lettuce, and soft burger buns. Served with 6 pieces of fried chicken (3 classic & 3 spicy), crispy French fries, creamy coleslaw, and two cocktail sauce dips.",
         "price": 75,
         "image": "images/offers/Family_Box.avif"
    },

     {
         "id": 9,
         "name": "Kabsa with Whole Chicken",
         "description": "A fragrant rice dish cooked with special Arabian spices, topped with a whole tender roasted chicken. Served with nuts and raisins for the perfect traditional feast.",
         "price": 80,
         "image": "images/offers/Kabsa.jpg"
    }

]